# Найдите количество различных элементов данного массива.

lis = [1, 4, 1, 7, 6, 1, 4, 3]
print(len(set(lis)))