# Пользователь вводит сторону квадрата. Найдите периметр и площадь квадрата.

a = int(input("Сторона квадрата: "))

print("Периметр: " + str(4 * a))
print("Площадь: " + str(a * a))