# Вычислите |x|+x5, если x=−2, ответ: -30

a = abs(-2) + (-2 ** 5)
print(a)