# Дан прямоугольник размером 647 x 170. Сколько квадратов со стороной 30 можно вырезать из него?

x = int(647 / 30)
y = int(170 / 30)

print(x * y)