# Вывести на экран букву "W" из символов "*" (звездочка).

print("*     *     *")
print(" *   * *   * ")
print("  * *   * *  ")
print("   *     *   ")
