# Даны два трехзначных числа. Найдите шестизначное число,
# образованное из двух данных чисел путем дописывания второго числа к первому справа


a = int(input())
b = int(input())
c = (1000 * a + b)
print(c)
