# Выведите на экран числа 1, 2, 3, 4, ..., 20


a = 0
while a < 20:
    a = a + 1
    print(a)
