# Вычислите | x | + x5, если x=−2. Ответ: -30

import math

x = -2

print(abs(x) + math.pow(x, 5))